# SpaceBoundaryLevel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExportOptions..::..SpaceBoundaryLevel Property
IFCExportOptions Class See Also
---
Level of space boundaries exported in IFC file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public int SpaceBoundaryLevel { get; set; }
```

Visual Basic
---
```text
Public Property SpaceBoundaryLevel As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int SpaceBoundaryLevel {
	int get ();
	void set (int value);
}
```

# Remarks
There are three valid values for this integer: 0 = export no space boundaries. This can save space if the receiving application doesn't use them. 1 = export 1st level space boundaries. This is the default. 2 = export 2nd level space boundaries. This is primarily for use in energy analysis programs, and the GSA. Default is 1.
# See Also
IFCExportOptions Class
Autodesk.Revit.DB Namespace